package com.company.Format;

import java.text.SimpleDateFormat;
import java.util.TimeZone;

public class ShortExamples {
    /*
    이번장은 가급적 말로만 정리한다. 예시 쓰다 정신 나갈거 같

    적절한 행길이를 유지하자

    개념은 빈 행으로 분리하라

    새로 밀집도는 높아야 한다.

    밀접한 개념으 수직거리가 같아야 한다.
    변수는 사용하는 위치에 최대한 가까이 선언한다.
    루프제어 변수는 루프 내에 선언한다.

    인스턴스 변수는 클래스 맨 처음에 선언한다. 그리고 변수간에 세로로 거리를 두지 않는다.

    한 함수가 다른 함수를 호출한다면 두 함수는 세로로 가까이 배치한다.

    비슷한 동작을 수행하는 함수는 가까이 붙히자.

    가로로는 짧은게 좋다.
    연산자는 앞뒤 공백을 줘 왼쪽과 오른쪽을 분명히 나누고 함수와 괄호는 이어지므로 붙힌다.
    연산자 우선순위를 바탕으로 붙히기도 하고 공백을 주시고 한다.
    가로 통짜 정렬은 구리다. 의도가 가려지기 쉽기 떄문이다.
    들여쓰기는 IDE를 믿자.

    짧은 한줄의 들여쓰기를 없애고 싶은 유혹도 정석대로 쓰는것이 좋다. if(조건)  결과; 이런거

    빈 while문이나 for문도 가급적 피하는것이 좋다.
    쓰고싶다면 while(반복반복)
    ;
    이런식으로 세미콜론을 다음줄에 넣어주는것이 좋다.

    팀단위로 작업할 시 팀의 규칙을 반드시 따라서 일관성을 보장해야 한다.
    온갖 스타일이 섞이면 그건 개판이 된다.
     */
}
