package com.company.Class;

public class ShortExamples {
    /*
    클래스 체계
    static public 최우선
    static private 그 다음
    그 후 비공개. 공개는 별로 없음

    테스트를 위해 함수나 변수는 protected
    그 외는 감춰야한다. 캡슐화는 최대한 풀면 안된다.

    클래스는 작아야 한다.

    단일 책임 원칙. SOLID의 S를 담당한다.
    이거는 변경할 이유가 하나여야 한다는 것이다.
    쪼개고 쪼개서 작은 클래스 여러개인것이 좋다.

    인스턴스 변수는 적어야 한다.
    많아지면 이건 분리해야한다는 징조

    이런 응집도를 지키면 잘 쪼개진 클래스들이 나온다.
    조갖조각 내자. 아예 독자적인 클래스로 쪼각쪼각.

    OCP, 확정엔 열려있고 수정엔 닫혀있어야하는 SOLID의 O를 담당하는 규칙.
    새롭게 추가를 할떈 추가를 하고 기존 코드에 손대는 일은 가능한 없게 하는것이 좋다.
     */

}
